{
  "general": "حدث خطأ. يرجى المحاولة مرة أخرى.",
  "invalidCredentials": "اسم المستخدم أو كلمة المرور غير صحيحة. يرجى المحاولة مرة أخرى.",
  "loadingListings": "فشل في تحميل القوائم. يرجى المحاولة مرة أخرى.",
  "networkError": "خطأ في الشبكة. يرجى التحقق من اتصالك والمحاولة مرة أخرى.",
  "notFound": "لم يتم العثور على المورد المطلوب.",
  "requestTimeout": "انتهت مهلة الطلب. قد يكون الخادم مشغولًا أو غير متوفر.",
  "serverUnavailable": "لا يمكن الاتصال بالخادم. يرجى التحقق من اتصالك بالإنترنت أو المحاولة مرة أخرى لاحقًا.",
  "unauthorized": "لست مخولاً لتنفيذ هذا الإجراء.",
  "validation": "يرجى التحقق من المدخلات والمحاولة مرة أخرى.",
  "session": {
    "refreshFailed": "فشل في تجديد جلستك. يرجى تسجيل الدخول مرة أخرى.",
    "expired": "انتهت صلاحية جلستك. يرجى تسجيل الدخول مرة أخرى.",
    "maxRetries": "غير قادر على إنشاء جلسة صالحة بعد محاولات متعددة. يرجى تسجيل الدخول مرة أخرى."
  },
  "auth": {
    "title": "خطأ في المصادقة",
    "sessionExpired": "يبدو أن جلستك قد انتهت صلاحيتها أو غير صالحة. يرجى المحاولة مرة أخرى أو تسجيل الدخول.",
    "additionalInfo": "معلومات إضافية: {{details}}"
  },
  "favorites": {
    "loadingFailed": "فشل في تحميل المفضلة. يرجى المحاولة مرة أخرى.",
    "sessionTokenMissingMaxRetries": "غير قادر على إنشاء جلسة صالحة بعد محاولات متعددة. يرجى تسجيل الدخول مرة أخرى.",
    "retryFailedNoSession": "لا يمكن المحاولة مرة أخرى بدون جلسة صالحة. يرجى تسجيل الدخول.",
    "unauthorized": "يتطلب تسجيل الدخول لعرض المفضلة."
  },
  "failedToLoadGovernorates": "فشل في تحميل المحافظات. يرجى المحاولة مرة أخرى.",
  "failedToLoadCarMakes": "فشل في تحميل ماركات السيارات. يرجى المحاولة مرة أخرى.",
  "failedToLoadCarModels": "فشل في تحميل موديلات السيارات. يرجى المحاولة مرة أخرى.",
  "isRequired": "مطلوب",
  "invalidYear": "يرجى إدخال سنة صالحة بين 1920 والسنة الحالية",
  "invalidMileage": "لا يمكن أن تكون المسافة المقطوعة سالبة",
  "invalidPrice": "يجب أن يكون السعر أكبر من الصفر",
  "failedToSubmitListing": "فشل في إنشاء الإعلان. يرجى المحاولة مرة أخرى."
}